In [5]:
import pandas as pd
import numpy as np

df_employee = pd.read_csv('employee_dataset.csv')
df_employee.head()

  Empid    Employeeename Department     Salary  Age Designation
0  E001    Laura Johnson    Finance   53220.17   38    Director
1  E002  Chris Rodriguez    Finance   72196.74   24   Executive
2  E003   Katie Martinez        NaN   43300.98   57         NaN
3  E004      Emily Smith      Sales   72241.28  NaN     Manager
4  E005   David Martinez         IT  115553.77   23    Director

In [8]:
df_employee.isna().sum()

Empid             0
Employeeename     0
Department       13
Salary           13
Age               9
Designation       9
dtype: int64

In [7]:
df_employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Empid          100 non-null    object
 1   Employeeename  100 non-null    object
 2   Department     87 non-null     object
 3   Salary         87 non-null     float64
 4   Age            91 non-null     object
 5   Designation    91 non-null     object
dtypes: float64(1), object(5)
memory usage: 4.8+ KB

In [ ]:
df_employee.fillna(value=None) #try yourself